In [173]:
import pandas as pd
df = pd.read_csv(r"D:\Data\Titanic_train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [174]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [175]:
(df.isnull().sum() / len(df)) * 100

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [176]:
df['Age']= df['Age'].fillna(df['Age'].median())
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [177]:
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode())
df['Embarked']

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [178]:
df = df.drop(columns= ['Cabin'])
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

In [179]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [180]:
df['Age']=df['Age'].fillna(df['Age'].median())
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [181]:
df['Fare']=df['Fare'].fillna(df['Fare'].median())
df['Fare']

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64

In [182]:
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])
df['Embarked']

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [183]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [184]:
before = df.shape[0]
print("Rows Figure :", before)

Rows Figure : 891

In [185]:
df_clean = df.drop_duplicates
df_clean

<bound method DataFrame.drop_duplicates of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female  28.0      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Embarked
0        0         A/5 21171   7.2500        S
1        0          PC 17599  71.2833        C
2        0  STON/O2. 3101282   7.9250        S
3        0            113803  53.1000        S
4        0            373450   8.0500        S
..     ...               ...      ...      ...
886      0            211536  13.0000        S
887      0            112053  30.0000        S
888      2        W./C. 6607  23.4500        S
889      0            111369  30.0000        C
890      0            370376   7.7500        Q

[891 rows x 11 columns]>

In [186]:
df.drop_duplicates(inplace = True)

In [187]:
before = df.shape[0]
before

891

In [188]:
after = df.shape[0]   # if inplace=True
print("Rows after:", after)

Rows after: 891

In [189]:
print ("Duplicates removed :", before - after)

Duplicates removed : 0

In [190]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Embarked        object
dtype: object

In [191]:
df['Age'] = df['Age'].astype(int)
df['Age']

0      22
1      38
2      26
3      35
4      35
       ..
886    27
887    19
888    28
889    26
890    32
Name: Age, Length: 891, dtype: int32

In [192]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age              int32
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Embarked        object
dtype: object

In [225]:
type1 = type(df_clean)
print(type1)

<class 'method'>

In [231]:
df_clean = df.drop_duplicates()  
df_clean

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,28,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.7500,Q

In [233]:
type(df_clean)

pandas.core.frame.DataFrame

In [237]:
df_clean.to_csv("titanic_cleaned.csv", index=False)

In [239]:
import os
os.listdir()

['.anaconda',
 '.conda',
 '.condarc',
 '.continuum',
 '.gitconfig',
 '.ipynb_checkpoints',
 '.ipython',
 '.jupyter',
 '.keras',
 '.matplotlib',
 '.spss',
 '.virtual_documents',
 '.vscode',
 'anaconda3',
 'anaconda_projects',
 'AppData',
 'Application Data',
 'basics-pr.ipynb',
 'Big Mart Sales.ipynb',
 'Blinkit Python Analysis.ipynb',
 'Contacts',
 'Cookies',
 'Documents',
 'Downloads',
 'Dummies and One Hot Encoder.ipynb',
 'Favorites',
 'Gradient Descent .ipynb',
 'Gradient Descent work.ipynb',
 'Hyper Parameter Tunning using Grid Search Cv(Cross Validation).ipynb',
 'iframe_figures',
 'K Means Clustering  practice.ipynb',
 'K Nearest Neighbor Algorithm .ipynb',
 'K-Means Cluster Algorithm.ipynb',
 'Kaggle',
 'KNIME 5.4.3 Installer (64bit).exe',
 'L1 and L2 Regularization.ipynb',
 'Links',
 'Local Settings',
 'Logistic regression Multiclass .ipynb',
 'Logistic Regression.ipynb',
 'Matplotlib.ipynb',
 'Matrix basics.ipynb',
 'Microsoft',
 'model_joblib',
 'model_pickle',
 'My Documents',
 'mysql-installer-web-community-8.0.42.0.msi',
 'Naive Bayes 2.ipynb',
 'Navie Bayes.ipynb',
 'Netflix Analysis.ipynb',
 'NetHood',
 'Neural network for hand written images.ipynb',
 'neural network for images.ipynb',
 'NTUSER.DAT',
 'ntuser.dat.LOG1',
 'ntuser.dat.LOG2',
 'NTUSER.DAT{4097460c-a474-11f0-a956-ff231a826bd4}.TM.blf',
 'NTUSER.DAT{4097460c-a474-11f0-a956-ff231a826bd4}.TMContainer00000000000000000001.regtrans-ms',
 'NTUSER.DAT{4097460c-a474-11f0-a956-ff231a826bd4}.TMContainer00000000000000000002.regtrans-ms',
 'ntuser.ini',
 'ONE HOT ENCODER.ipynb',
 'OneDrive',
 'OneDrive - thinkcloud.in',
 'PCA.ipynb',
 'Pickle,Joblib (SAVE).ipynb',
 'Piechart_bomma.png',
 'pip install jupyterlab.py',
 'pip install notebook.py',
 'pip install streamlit.py',
 'PrintHood',
 'PyCharmMiscProject',
 'Random forest Algorithm.ipynb',
 'Recent',
 'Saved Games',
 'seaborn-Barplot.ipynb',
 'Seaborn-Boxplot.ipynb',
 'Seaborn-Catplot.ipynb',
 'Seaborn-Countlot.ipynb',
 'Seaborn-Facetgrid.ipynb',
 'Seaborn-Factorplot.ipynb',
 'Seaborn-Heatmap.ipynb',
 'Seaborn-Pairplot.ipynb',
 'seaborn-scatterplot.ipynb',
 'Seaborn-Stylingplot.ipynb',
 'seaborn_Histogram.ipynb',
 'seabron-stripplot .ipynb',
 'Seabron-Violinplot.ipynb',
 'Searches',
 'SendTo',
 'SLR.ipynb',
 'Start Menu',
 'SVM algorithm.ipynb',
 'TableauDesktop-64bit-2024-3-3.exe',
 'Task 5.ipynb',
 'Templates',
 'Test1',
 'Test1.csv',
 'test_scores.csv',
 'titanic_cleaned.csv',
 'Untitled-1.ipynb',
 'Untitled.ipynb',
 'untitled.py',
 'Untitled1.ipynb',
 'untitled1.py',
 'Untitled10.ipynb',
 'Untitled11.ipynb',
 'Untitled12.ipynb',
 'Untitled13.ipynb',
 'Untitled14.ipynb',
 'Untitled15.ipynb',
 'Untitled16.ipynb',
 'Untitled2.ipynb',
 'untitled2.py',
 'Untitled3.ipynb',
 'untitled3.py',
 'Untitled4.ipynb',
 'untitled4.py',
 'Untitled5.ipynb',
 'untitled5.py',
 'Untitled6.ipynb',
 'untitled6.py',
 'Untitled7.ipynb',
 'Untitled8.ipynb',
 'Untitled9.ipynb',
 'VLC media player.lnk',
 'wix314.exe',
 'WPS Cloud Files']

In [241]:
from IPython.display import FileLink
FileLink("titanic_cleaned.csv")

C:\Users\HP\titanic_cleaned.csv

In [243]:
import pandas as pd

df_loaded = pd.read_csv("titanic_cleaned.csv")
df_loaded.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,S

In [245]:
# Handling Missing Values

Some columns had missing data, which can affect analysis and models.

Numeric columns were filled using mean/median to keep the data balanced.

Categorical columns were filled using the most frequent value (mode).

Columns with too many missing values and low importance were dropped.


#Removing Duplicates

Duplicate rows can bias results and cause incorrect insights.
We used .drop_duplicates() to remove repeated records and verified the row count before and after cleaning.


#Converting Data Types

Some columns were stored as text instead of numbers or dates.
We converted them to the correct data types (e.g., numeric, datetime) to allow proper calculations and analysis.


#Creating New Columns (Feature Engineering)

New columns were created using logical rules to improve analysis, such as:

Age groups (Child, Adult, Senior)

Price/Fare bands

Profit margin (if applicable)

This helps models understand patterns better.


#Saving the Cleaned Dataset

After cleaning, the final dataset was saved as a CSV file using .to_csv() so it can be reused for analysis and modeling.

SyntaxError: invalid syntax (599807159.py, line 3)